app/controllers/search_controller.rb

  def index

    @search_terms = params[:s]
    @app = params[:app]


    @clean_search_terms  = clean_up(@search_terms)

    @result_array = ["hi","there", "world","hi","there", "world","hi","there", "world","hi","there", "world","hi","there", "world"]
    # the mapping approach below came from http://snippets.dzone.com/posts/show/3901
    @result_array = Search.all(:order => 'priority ASC', :limit => 10, :conditions => ["candidate LIKE ?", @clean_search_terms +"%"]).map(&:candidate_label) # only return candidate strings
---
SELECT * FROM "searches" WHERE (candidate LIKE '%and%') ORDER BY priority DESC LIMIT 10